/*
Студент: Папко Роман.
Geekbrains. Факультет python-разработки.
Четверть 1. Базы данных.
Домашнее задание №1
Напишите ответы на вопросы в комментарий при сдаче практического задания:
1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?
2) В какой сфере работаете сейчас?
3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?
*/
/*
1. Сформировать понятие о структуре и принципах работы с клиент-серверными базами данных (больше интересно postgresql). Научиться разрабатывать стуктуру БД, взаимодействовать с БД.
2. Работаю в сфере сервисных услуг. Инженер (Электросети, водопровод, канализация). Опыт работы с ПК, построения и администрированием сетей ИП-видеонаблюдения на уровне хобби. Хобби - unix-подробные ОС.
3. см. п.2
*/
